# 首先验证一下subsearch方法：
index="*int_firewall_palo_traffic" (dvc_name=GAEQUXATIFWO1 OR dvc_name=GAEQUXATIFWO2 OR dvc_name=GAEQUXATIFWO3 OR dvc_name=GAEQUXATIFWO4) (src_translated_ip != "0.0.0.0")
| eval found=0
| map search="| inputlookup MS_IP.csv | where cidrmatch(subnet, \"$dest_ip$\") | eval found=1"
| where found=0
| head 10
| table dest_ip, found

# 如果上面测试成功，使用完整查询：
index="*int_firewall_palo_traffic" (dvc_name=GAEQUXATIFWO1 OR dvc_name=GAEQUXATIFWO2 OR dvc_name=GAEQUXATIFWO3 OR dvc_name=GAEQUXATIFWO4) (src_translated_ip != "0.0.0.0")
| eval found=0
| map maxsearches=1000 search="| inputlookup MS_IP.csv | where cidrmatch(subnet, \"$dest_ip$\") | eval found=1"
| where found=0
| eval source_type=if(dest_port="80" OR dest_port="443", "Ports:80/443","Other Ports")
| stats sum(bytes_out) as TotalBytes by source_type


index="*int_firewall_palo_traffic" (dvc_name=GAEQUXATIFWO1 OR dvc_name=GAEQUXATIFWO2 OR dvc_name=GAEQUXATIFWO3 OR dvc_name=GAEQUXATIFWO4) (src_translated_ip != "0.0.0.0")
| where NOT [| inputlookup MS_IP.csv 
    | rename subnet as pattern
    | format "cidrmatch(\"%pattern%\", dest_ip)" 
    | eval search=join(" OR ", format)
    | return $search$]
| eval source_type=if(dest_port="80" OR dest_port="443", "Ports:80/443","Other Ports")
| stats sum(bytes_out) as TotalBytes by source_type
