index="*int_firewall_palo_traffic" (dvc_name=GAEQUXATIFWO1 OR dvc_name=GAEQUXATIFWO2 OR dvc_name=GAEQUXATIFWO3 OR dvc_name=GAEQUXATIFWO4) (src_translated_ip != "0.0.0.0")
| where NOT [| inputlookup MS_IP.csv 
    | format "cidrmatch(\"%subnet%\", dest_ip)" 
    | eval search = join(" OR ", format)
    | return $search]
| eval source_type=if(dest_port="80" OR dest_port="443", "Ports:80/443","Other Ports")
| stats sum(bytes_out) as TotalBytes by source_type
