index="*int_firewall_palo_traffic" (dvc_name=GAEQUXATIFWO1 OR dvc_name=GAEQUXATIFWO2 OR dvc_name=GAEQUXATIFWO3 OR dvc_name=GAEQUXATIFWO4)
| eval match_any=0
| lookup local=true MS_IP.csv subnet as network
| eval match_any=case(
    cidrmatch(network, dest_ip), 1,
    true(), match_any)
| head 10
| table dest_ip, network, match_any
